Microchip-MPLAB-Harmony/csp/apps/adc/adc_automatic_window_comparison/firmware/src/packs/ATSAMA5D27_DFP/component/rtc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief RTC_TS register API structure */
typedef struct
{
  __I   uint32_t                       RTC_TSTR;           /**< Offset: 0x00 (R/   32) TimeStamp Time Register 0 */
  __I   uint32_t                       RTC_TSDR;           /**< Offset: 0x04 (R/   32) TimeStamp Date Register 0 */
  __I   uint32_t                       RTC_TSSR;           /**< Offset: 0x08 (R/   32) TimeStamp Source Register 0 */
} rtc_ts_registers_t;

#define RTC_TS_NUMBER _U_(2)

/** \brief RTC register API structure */
typedef struct
{
  __IO  uint32_t                       RTC_CR;             /**< Offset: 0x00 (R/W  32) Control Register */
  __IO  uint32_t                       RTC_MR;             /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       RTC_TIMR;           /**< Offset: 0x08 (R/W  32) Time Register */
  __IO  uint32_t                       RTC_CALR;           /**< Offset: 0x0C (R/W  32) Calendar Register */
  __IO  uint32_t                       RTC_TIMALR;         /**< Offset: 0x10 (R/W  32) Time Alarm Register */
  __IO  uint32_t                       RTC_CALALR;         /**< Offset: 0x14 (R/W  32) Calendar Alarm Register */
  __I   uint32_t                       RTC_SR;             /**< Offset: 0x18 (R/   32) Status Register */
  __O   uint32_t                       RTC_SCCR;           /**< Offset: 0x1C ( /W  32) Status Clear Command Register */
  __O   uint32_t                       RTC_IER;            /**< Offset: 0x20 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       RTC_IDR;            /**< Offset: 0x24 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       RTC_IMR;            /**< Offset: 0x28 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       RTC_VER;            /**< Offset: 0x2C (R/   32) Valid Entry Register */
  __I   uint8_t                        Reserved1[0x80];
        rtc_ts_registers_t             RTC_TS[RTC_TS_NUMBER]; /**< Offset: 0xB0  */
} rtc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_RTC_COMPONENT_H_ */
